{
  "chapter_name": "1: Introduction to Computer Networks & Internet",
  "pages": [
    {
      "page_number": "1",
      "content": "2°\nDarsh an 1 — Introduction to Computer Networks & Internet\n\nComputer Network\n\nA computer network is a system in which multiple computers are connected to each other to\nshare information and resources.\n\nThe physical connection between networked computing devices is established using either cable\nmedia or wireless media.\n\nThe best-known computer network is the Internet.\n\n[_\nwe\neee\n\n|\n\nCOMPUTER\nWETWORK\n\nSy\n\na\n\nFigure 1: Computer Network\n\nAdvantages of Computer Networks\n\nFile sharing\n\nThe major advantage of a computer network is that allows file sharing and remote file access. A\nperson sitting at one workstation that is connected to a network can easily see files present on\nanother workstation, provided he is authorized to do so.\n\nResource sharing\n\nAll computers in the network can share resources such as printers, fax machines, modems, and\nscanners.\n\nBetter connectivity and communications\n\nIt allows users to connect and communicate with each other easily. Various communication\napplications included e-mail and groupware are used. Through e-mail, members of a network\ncan send a message and ensure safe delivery of data to other members, even in their absence.\nInternet access\n\nComputer networks provide internet service over the entire network. Every single computer\nattached to the network can experience the high-speed internet.\n\nEntertainment\n\nMany games and other means of entertainment are easily available on the internet.\nFurthermore, Local Area Networks (LANs) offers and facilitates other ways of enjoyments, such\nas many players are connected through LAN and play a particular game with each other from a\nremote location.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 1\n"
    },
    {
      "page_number": "2",
      "content": "D Darshan\n\nasesuée ot Encinaectug ak reohsokes 1 — Introduction to Computer Networks & Internet\n\ne Inexpensive system\nShared resources mean reduction in hardware costs. Shared files mean reduction in memory\nrequirement, which indirectly means a reduction in file storage expenses. A particular software\ncan be installed only once on the server and made available across all connected computers at\nonce. This saves the expense of buying and installing the same software as many times for as\nmany users.\n\ne Flexible access\nA user can log on to a computer anywhere on the network and access his files. This offers\nflexibility to the user as to where he should be during the course of his routine.\n\ne Instant and multiple access\nComputer networks are multiple processes. Many users can access the same information at the\nsame time. Immediate commands such as printing commands can be made with the help of\ncomputer networks.\n\nDisadvantages of Computer Networks\n\ne Lack of data security and privacy\nBecause there would be a huge number of people who would be using a computer network to\nget and share some of their files and resources, a certain user’s security would be always at risk.\nThere might even be illegal activities that would occur, which you need to be careful about and\naware of.\n\ne Presence of computer viruses and malware\nIf even one computer on a network gets affected by a virus, there is a possible threat for the\nother systems getting affected too. Viruses can spread on a network easily, because of the inter-\nconnectivity of workstations. Moreover, multiple systems with common resources are the\nperfect breeding ground for viruses that multiply.\n\ne Lack of Independence\nSince most networks have a centralized server and dependent clients, the client users lack any\nfreedom whatsoever. Centralized decision making can sometimes hinder how a client user\nwants to use his own computer.\n\ne Lack of Robustness\nAs previously stated, if a computer network’s main server breaks down, the entire system would\nbecome useless. Also, if it has a bridging device or a central linking server that fails, the entire\nnetwork would also come to a standstill.\n\ne Need an efficient handler\nFor a computer network to work efficiently and optimally, it requires high technical skills and\nknow-how of its operations and administration. A person just having basic skills cannot do this\njob. Take note that the responsibility to handle such a system is high, as allotting permissions\nand passwords can be daunting. Similarly, network configuration and connection is very tedious\nand cannot be done by an average technician who does not have advanced knowledge.\n\nUse (Applications) of Computer Networks\ne Financial services\nNowadays, almost all the financial services depend on the computer network. You can access\nthe financial services across the world. For example, a user can transfer money from one place\nto another by using the electronic fund transfer feature. You can use networking in various\nfinancial areas such as ATM, foreign exchange and credit history search.\ne Business\n\nProf. Maulik Trivedi, CE Department | 2140709 - Computer Networks (CN) 2\n"
    },
    {
      "page_number": "3",
      "content": "eo\n| Dar. sh qn 1 — Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\nNowadays, most of the works of businesses are done over the computers. To exchange the data\nand ideas, you need effective data and resources sharing features. To do this, you need to\nconnect the computer with each other through a network. For example, a person of one\ndepartment of an organization can share or access the electronic data of other departments\nthrough a network.\n\nEmail services\n\nA computer network provides you the facility to send or receive emails across the globe in few\nseconds.\n\nMobile applications\n\nBy using mobile applications, such as cellular or wireless phones, you can communicate\n(exchange your views and ideas) with one other.\n\nDirectory services\n\nIt provides you the facility to store files on a centralized location to increase the speed of search\noperation worldwide.\n\nTeleconferencing\n\nIt contains voice conferencing and video conferencing which are based on networking. In\nteleconferencing, the participants need not be presented at the same location.\n\nTypes of Computer Networks\nLAN (Local Area Network)\n\nIt is privately-owned networks within a single building or campus of up to a few kilometers in\nsize.\n\nThey are widely used to connect personal computers and workstations in company offices and\nfactories to share resources (e.g., printers) and exchange information.\n\nLANs are easy to design and troubleshoot\n\nIn LAN, all the machines are connected to a single cable.\n\nDifferent types of topologies such as Bus, Ring, Star, and Tree are used.\n\nThe data transfer rates for LAN is up to 10 Gbits/s.\n\nThey transfer data at high speeds. The high transmission rate is possible in LAN because of the\nshort distance between various computer networks.\n\nThey exist in a limited geographical area.\n\nAdvantages\n> LAN transfers data at high speed.\n> LAN technology is generally less expensive.\n\nLocal Area Network (LAN)\n\ni? fe\n\n\\ 4\nPrinter __ Ll a 3% Floppy (A:)\n\\\n\n/\n-—= f-\n\nFigure 2: Local Area Network\n\nProf. Maulik Trivedi, CE Department | 2140709 - Computer Networks (CN) 3\n"
    },
    {
      "page_number": "4",
      "content": "2°\n| Darsh an 1 — Introduction to Computer Networks & Internet\n\nMAN (Metropolitan Area Network)\n\ne MAN is a larger version of LAN which covers an area that is larger than the covered by LAN but\nsmaller than the area covered by WAN.\n\ne A metropolitan area network or MAN covers a city. The best-known example of a MAN is the\ncable television network available in many cities.\n\ne MAN connects two or more LANs.\n\ne At first, the companies began jumping into the business, getting contracts from city\ngovernments to wire up an entire city.\n\ne The next step was television programming and even entire channels designed for cable only.\n\n|=\na=\nBe —\n\nBranch Office\n\nWarehouse\n\nCentral Office\n\nFactory\nFigure 3: Metropolitan Area Network\n\nWAN ( Wide Area Network)\n\nWAN spans a large geographical area, often a country or region.\n\ne WAN links different metropolitan's countries and national boundaries thereby enabling easy\ncommunication.\n\ne It may be located entirely within a state or a country or it may be interconnected around the\nworld.\n\ne It contains a collection of machines intended for running user (i.e., application) programs.\nWe will follow traditional usage and call these machines hosts.\n\ne The communication between different users of WAN is established using leased telephone\n\nlines or satellite links and similar channels.\nMetropolitan Area Network (MAN) Metropolitan Area Network sor\n\nMetropolitan Area Network (MAN) Metropolitan Area Network (MAN)\nFigure 4: Wide Area Network\n\nProf. Maulik Trivedi, CE Department | 2140709 - Computer Networks (CN) 4\n"
    },
    {
      "page_number": "5",
      "content": "D Darshan\n\niaehhe Of Snaineurtng ad Tochiseleny 1 — Introduction to Computer Networks & Internet\n\nDifference between LAN, MAN, and WAN.\n\nParameter LAN MAN WAN\n\nArea covered Covers a small area. i.e. | Covers larger than LAN | Covers large area\nwithin building & smaller than WAN\n\nError rates Lowest Moderate Highest\n\nTransmission speed High speed Moderate speed Low speed\n\nEquipment cost Inexpensive Moderate-expensive Most expensive\n\nDesign & maintenance | Easy Moderate Difficult\n\nInternet\n\ne The internet is a type of world-wide computer network.\n\ne = The internet is the collection of infinite numbers of connected computers that are spread across\nthe world.\n\ne We can also say that the Internet is a computer network that interconnects hundreds of millions\nof computing devices throughout the world.\n\ne It is established as the largest network and sometimes called a network of a network that\nconsists of numerous academic, business and government networks, which together carry\nvarious information.\n\ne The Internet is a global computer network providing a variety of information and\ncommunication facilities, consisting of interconnected networks using standardized\ncommunication protocols.\n\ne When two computers are connected over the Internet, they can send and receive all kinds of\ninformation such as text, graphics, voice, video, and computer programs.\n\nCompany Network as coy\n\nKey:\n\nBp i }\n= VW B&B @eei'sa\n\n(or ond system) switch station fink\n\nFigure 5: Some pieces of the Internet\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 5\n"
    },
    {
      "page_number": "6",
      "content": "(D Darshan\n\niaehhe Of Snaineurtng ad Tochiseleny 1 — Introduction to Computer Networks & Internet\n\nProtocol\n\nA protocol is a set of rules that govern (manages) data communications.\nProtocols define methods of communication, how to communicate when to communicate etc.\nA protocol is an agreement between the communicating parties on how communication is to\nproceed.\nImportant elements of protocols are\n\n1. Syntax 2. Semantics 3. Timing\nSyntax:- Syntax means format of data or the structure how it is presented e.g. first eight bits are\nfor sender address, next eight bits are for receiver address and rest of the bits for message data.\nSemantics:- Semantics is the meaning of each section of bits e.g. the address bit means the\nroute of transmission or final destination of a message.\nTiming:- Timing means, at what time data can be sent and how fast data can be sent.\nSome protocols also support message acknowledgment and data compression designed for\nreliable and/or high-performance network communication.\nExample: HTTP, IP, FTP etc...\n\nFigure 6: A human protocol and a computer network protocol\n\nThe Network Edge\n\nIt defines those computers of the network used at the edge (end) of the network. These\ncomputers are known as hosts or end system.\nA host can be classified into the following two types:\n> Clients: Refer to the computer systems that request servers for the completion of a task.\nThe clients are generally called desktop PCs or workstations.\n> Servers: Refer to the computer systems that receive requests from the clients and\nprocess them. After the processing is complete, the servers send a reply to the clients\nwho sent the request.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 6\n"
    },
    {
      "page_number": "7",
      "content": "e\nDar. sh an 1 - Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\ne The concept of clients and servers is essential in the network design. The various networks\ndesign models are as follows:\n1. Peer to Peer network 2. Client-Server network\n\nPeer to Peer network\ne In this network group of computers is connected together so that users can share resources and\ninformation.\ne There is no central location (server) for authenticating users, storing files, or accessing resources\nand each of them works as both client and server.\ne This means that users must remember which computers in the workgroup have the shared\nresource or information that they want to access.\ne Advantage:\n>  Itis easy to set up.\n> There is no need for any committed server as each peer acts as both server and client.\n> The network implementation is quite cheap.\n> The resources of a peer can be shared with other peers very easily in the network.\ne Disadvantage:\nThe speed of the network decreases due to heavy usage.\nIt is not easy to keep track of information on each computer.\nThere is no central backup of files and folders.\nNetwork and data security are weak.\n\nCentral Server\npe Distributed\nEe} Clients\n\nA\\. 8+ 38\nS865 -g°\n\nClient / Server Peer to Peer\n\nVVVV\n\nFigure 7: Network Edge - Client/Server Network and Peer to Peer\nClient/Server network\ne Aclient/server network is a system where one or more computers called clients to connect to a\ncentral computer named as a server to share or use resources.\n\ne The client requests a service from a server, which may include running an application,\nquerying a database, printing a document, performing a backup or recovery procedure. The\nrequest made by the client is handled by a server.\n\ne Aclient/server network is that in which the files and resources are centralized. This means\nthat the server can hold them and other computers (Client) can access them.\n\ne Advantage:\n> The server system holds the shared files.\n> The server system can be scheduled to take the file backups automatically.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 7\n"
    },
    {
      "page_number": "8",
      "content": "D Darshan\n\nasesuée ot Encinaectug ak reohsokes 1 — Introduction to Computer Networks & Internet\n\n> Network access is provided only to authorized users through user security at the\nserver.\n> The server system is a kind of central repository for sharing a printer with clients.\n> Internet access, e-mail routing, and such other networking tasks are quite easily\nmanaged by the server.\n> The software applications shared by the server are accessible to the clients.\ne Disadvantage:\nThe implementation of the network is quite expensive.\nAn NOS (Network Operating System) is essential.\nIf a server fails, the entire network crashes.\nThere may be congestion if more than one client requests for a service at the same\ntime.\n\nTechniques used in data communications to transfer data\n\n1. Connection-oriented method 2. Connectionless method\n\nConnection-oriented method\n\ne Connection-oriented communication includes the steps of setting up a call from one computer\nto another, transmitting/receiving data, and then releasing the call, just like a voice phone call.\n\ne However, the network connecting the computers is a packet switched network, unlike the\nphone system's circuit switched network.\n\ne Connection-oriented communication is done in one of two ways over a packet switched\nnetwork:\n\n1. Without virtual circuits\n2. With virtual circuits.\nWithout virtual circuits:\n\ne = This is what TCP does on the Internet.\n\ne The only two machines on the Internet are aware of the connection which is established\nbetween the two computers at the endpoints.\n\ne The Internet itself, its routers and links have no information about the presence of a connection\nbetween the two computers.\n\ne This means that all of the packets flowing between the two computers can follow different\nroutes.\n\ne One benefit of establishing the connection is that the flow of packets from the source to the\ndestination can be slowed down if the Internet is congested and speeded up when congestion\ndisappears.\n\ne Another benefit is that the endpoints can anticipate traffic between them, and agree to\ncooperate to ensure the integrity and continuity of the data transfers. This allows the network\nto be treated as a \"stream\" of data.\n\nWith virtual circuit:\n\ne This is not used on the Internet, but is used in other types of networks (eg. the \"X.25\" protocol,\nstill popular in Europe).\n\ne The routers within the network route all packets in one connection over the same route. The\nadvantage is that video and voice traffic is easier to carry because routers can reserve memory\nspace to buffer the transmission.\n\nVVVV\n\nProf. Maulik Trivedi, CE Department | 2140709 - Computer Networks (CN) 8\n"
    },
    {
      "page_number": "9",
      "content": "eo\n| Dar. sh qn 1 — Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\nConnectionless method\ne Connectionless communication is just packet switching where no call establishment and release\noccur.\ne A message is broken into packets, and each packet is transferred separately. Moreover, the\npackets can travel a different route to the destination since there is no connection.\ne Connectionless service is typically provided by the UDP (User Datagram Protocol). The packets\n\ntransferred using UDP are also called datagrams.\nA Virtual Circuit\n\n{a} Connectionless Network {b) Connection-Oriented Network\n\nFeature Connectionless Connection-oriented\n\nHow is data sent? One packet at a time Continuous stream of packets\n\nDo packets follow the same route? No Virtual circuit: yes\nWithout virtual circuit: no\n\nAre resources reserved in the | No Virtual circuit: yes\n\nnetwork? Without virtual circuit: no\n\nAre resources reserved in No Yes\n\ncommunicating hosts?\n\nIs connection establishment done? No Yes\n\nIs state information stored at No Virtual circuit: yes\n\nnetwork nodes? Without virtual circuit: no\n\nWhat is the impact of node/switch Only packets at a node All virtual circuits through node fail\n\ncrash? are lost\n\nWhat addressing information is Full source and Virtual circuit: virtual circuit number\n\nneeded on each packet? destination address Without virtual circuit: full source and\ndestination address\n\nProf. Maulik Trivedi, CE Department | 2140709 - Computer Networks (CN) 9\n"
    },
    {
      "page_number": "10",
      "content": "D Darshan\n\niaieniee Of Enginearting sl Techootiny 1 — Introduction to Computer Networks & Internet\n\nTransmission Media\n\ne Atransmission media can be defined as anything that can carry information from a source to a\ndestination.\n\ne On the basis of transmission of data, the transmission media can be classified into two\ncategories:\n1. Guided (Physical) transmission media\n2. Unguided (Wireless) transmission media\n\nTransmission Media\n\nGuided Media\n\nUnguided Media\n\nTwisted-Pair Coaxial Fiber Optic Radio Microwave Infrared\nCable Cable Cable Wave\n\nWave\n\nFigure 8: Classification Transmission Media\n\nGuided Transmission Media\ne Guided media are those that provide a channel from one device to another.\ne The three Guided (Physical) media commonly used for data transmission are:\n\n1. Twisted-Pair 2. Coaxial 3. Fiber Optics\n1. Twisted Pair\n\ne Atwisted pair consists of two insulated copper wires, typically about 1 mm thick.\ne The wires are twisted together in a helical form, just like a DNA molecule.\ne Twisting is done because two parallel wires constitute a fine antenna.\n\ne When the wires are twisted, the waves from different twists cancel out, so the wire radiates less\neffectively.\n\nInsulator < SOCDOCK > Conductors\n\nFigure 9: Twisted Pair Cable\nWhy cable is twisted?\n\ne If the two wires are parallel, the effect of these unwanted signals is not the same in both wires\nbecause they are at different locations relatives to the noise or crosstalk sources.\ne This results in a difference at the receiver.\n\ne By twisting the pair, a balance is maintained.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 10\n"
    },
    {
      "page_number": "11",
      "content": "D Darshan\n\nasesuée ot Encinaectug ak reohsokes 1 — Introduction to Computer Networks & Internet\n\nTypes of Twisted-Pair Cable\n\n1)\n\nUnshielded twisted-pair (UTP)\n\nTwisted pair cabling comes in several varieties, two of which are important for computer\nnetworks.\n\nCategory 3 twisted pairs consist of two insulated wires gently twisted together.\n\nMost office buildings had one category 3 cable running from a central wiring closet on each floor\ninto each office.\n\nCategory 5 is the more advanced twisted pairs were introduced.\n\nThey are similar to category 3 pairs, but with more twists per centimeter, which results in less\ncrosstalk and a better-quality signal over longer distances, making them more suitable for high-\nspeed computer communication.\n\nUp-and-coming categories are 6 and 7, which are capable of handling signals with bandwidths of\n250 MHz and 600 MHz, respectively (versus a mere 16 MHz and 100 MHz for categories 3 and 5\nrespectively).\n\nCategory 3 UTP. Category 5 UTP.\n\nFigure 10: Unshielded twisted-pair\n\nShielded twisted-pair (STP).\nSTP cable has a metal foil or braided mesh covering that encases each pair of insulated\nconductors.\nMetal casing improves the quality of cable by preventing the penetration of noise or crosstalk.\nIt is bulkier and more expensive.\nApplications:\n> Used in telephone lines to provide voice and data channels.\n> The DSL lines use by telephone companies use the high-bandwidth capability of UTP\ncables.\n> LANs, such as 10Base-T, 100Base-T also uses twisted-pair cables.\n\n2. Coaxial Cable\n\nIt has better shielding than twisted pairs, so it can span longer distances at higher speeds.\n\nTwo kinds of the coaxial cable are widely used. One kind is a 50-ohm cable which is commonly\nused when it is intended for digital transmission from the start.\n\nThe other kind is a 75-ohm cable which is commonly used for analog transmission and cable\ntelevision but is becoming more important with the advent of the Internet over cable.\n\nA coaxial cable consists of stiff copper wire as the core surrounded by an insulating material.\n\nThe insulator is encased by a cylindrical conductor, often as a closely-woven braided mesh.\n\nThe outer conductor is covered in a protective plastic sheath.\n\nThe construction and shielding of the coaxial cable give it a good combination of high bandwidth\nand excellent noise immunity.\n\nThe bandwidth possible depends on the cable quality, length, and signal-to-noise ratio of the\ndata signal. Modern cables have a bandwidth of close to 1 GHz.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 11\n"
    },
    {
      "page_number": "12",
      "content": "J\n| Darsh an 1 — Introduction to Computer Networks & Internet\n\ne Coaxial cables used is widely used within the telephone system for long-distance lines but have\nnow largely been replaced by fiber optics on long-haul routes.\n\nCopper Insulating Braided Protective\nmaterial outer plastic\nconductor covering\n\n\\ NESTS STE STN\nDOO OA AX 4\n\nFigure 11: Coaxial Cable\n3. Fiber Optics\ne A fiber-optic cable is made of glass or plastic and transmits signals in the form of light.\ne Optical fibers use reflection to guide light through a channel.\ne  Aglass or plastic core is surrounded by a cladding of less dense glass or plastic.\ne The difference in density of the two materials must be such that a beam of light moving through\nacore is reflected off the cladding instead of being refracted into it.\n\nSheath ~“ Jacket\nCore\n\\\n\nCladding Jacket\n(glass) (plastic) Core Cladding\n(a) (b)\n\nFigure 12: Fiber Optic Cable\n\ne Fiber optic cables are similar to coax, except without the braid.\ne The figure shows a single fiber viewed from the side. At the center is the glass core through\nwhich the light propagates.\ne The core is surrounded by a glass cladding with a lower index of refraction than the core, to keep\nall the light in the core.\ne Next comes a thin plastic jacket to protect the cladding. Fibers are typically grouped in bundles,\nprotected by an outer sheath. The figure shows a sheath with three fibers.\nUnguided (Wireless) transmission media\ne Unguided media transport electromagnetic waves without using a physical conductor. This type\nof communication is often referred to as wireless communication.\n1. Radio Transmission 3. Infrared\n2. Microwave Transmission 4. Lightwave Transmission\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 12\n"
    },
    {
      "page_number": "13",
      "content": "D Darshan\n\niaieniee Of Enginearting sl Techootiny 1 — Introduction to Computer Networks & Internet\n\n1. Radio Transmission\n\ne Radio waves are easy to generate, can travel long distances, and can penetrate buildings easily,\nso they are widely used for communication, both indoors and outdoors.\n\ne Radio waves also are omnidirectional, meaning that they travel in all directions from the source,\nso the transmitter and receiver do not have to be carefully aligned physically.\n\ne The properties of radio waves are frequency dependent.\n\ne At low frequencies, radio waves pass through obstacles well, but the power falls off sharply with\ndistance from the source, roughly as 1/r’ in the air.\n\ne At high frequencies, radio waves tend to travel in straight lines and bounce off obstacles. They\nare also absorbed by rain.\n\ne At all frequencies, radio waves are subject to interference from motors and other electrical\nequipment.\n\nNie?\n<<\n\nV\n\nEarth's surface\nFigure 13: Ground wave\ne Inthe VLF, LF, and MF bands, radio waves follow the curvature of the earth.\ne Inthe HF they bounce off the ionosphere.\n2. Microwave Transmission\n\ne Since the microwaves travel in a straight line, if the towers are too far apart, the earth will get in\nthe way. Consequently, repeaters are needed periodically.\n\ne Unlike radio waves at lower frequencies, microwaves do not pass through buildings well. In\naddition, even though the beam may be well focused at the transmitter, there is still some\ndivergence in space.\n\ne Above 100 MHz, the waves travel in straight lines and can, therefore, be narrowly focused.\nConcentrating all the energy into a small beam using a parabolic antenna gives a much higher\nsignal to noise ratio.\n\ne Advantages:\n\n> No right way is needed (compared to wired media).\n> Relatively inexpensive.\n> Simple to install.\ne Disadvantages:\nDo not pass through buildings well.\nMultipath fading problem (the delayed waves cancel the signal).\nAbsorption by rain above 8 GHz.\nA severe shortage of spectrum.\n\nVVVV\n\n3. Infrared\ne Unguided infrared and millimetre waves are widely used for short-range communication.\ne The remote controls used on televisions, VCRs, and stereos all use infrared communication.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 13\n"
    },
    {
      "page_number": "14",
      "content": "e\n| Dar. sh an 1 - Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\n“» remote control\n\nFigure 14: Infrared wave connection\n\ne They are relatively directional, cheap, and easy to build but have a major drawback: they do not\npass through solid objects (try standing between your remote control and your television and\nsee if it still works).\n\ne In general, as we go from long-wave radio toward visible light, the waves behave more and more\nlike light and less and less like a radio.\n\ne On the other hand, the fact that infrared waves do not pass through solid walls well is also a\nplus.\n\ne It means that an infrared system in one room of a building will not interfere with a similar\nsystem in adjacent rooms or buildings.\n\ne Furthermore, security of infrared systems against eavesdropping is better than that of radio\nsystems precisely for this reason.\n\ne Therefore, no government license is needed to operate an infrared system, in contrast to radio\nsystems, which must be licensed outside the ISM bands.\n\nTopologies (Network Topologies)\nNetwork Topology is the schematic description of a network arrangement, connecting various\nnodes (sender and receiver) through lines of connection.\ne A Network Topology is the arrangement with which computer systems or network devices are\nconnected to each other.\ne Types of network topologies :\n\n1. Bus 3. Star 5. Tree\n2. Ring 4. Mesh 6. Hybrid\nBus Topology\ne Bus topology is a network type in which every computer and network device is connected to a\nsingle cable.\nCable End Cable End\n\n| Drop Line | Drop Line | Drop Line\n\nProf. Maulik Trivedi, CE Department | 2140709 - Computer Networks (CN) 14\n"
    },
    {
      "page_number": "15",
      "content": "2°\n| Darsh an 1 — Introduction to Computer Networks & Internet\n\nFeatures:\ne It transmits data only in one direction.\ne Every device is connected to a single cable.\nAdvantages:\ne It is cost effective (cheaper).\ne Cable required is least compared to other network topology.\ne Used in small networks.\ne It is easy to understand.\ne Easy to expand joining two cables together.\nDisadvantages:\ne Cables fail then the whole network fails.\ne If network traffic is heavy or nodes are more the performance of the network decreases.\ne Cable has a limited length.\nRing Topology\ne It is called ring topology because it forms a ring as each computer is connected to another\ncomputer, with the last one connected to the first. Exactly two neighbors for each device.\n\n=\nae\n= x\n\\\nZ \\\nFi i\nyf \\\nx Ring Topology a4\n<a 1\n\n=\n\n7 mS. 7\n\n™~ Re\ni a“\n™ “\nBo “\nbe a“\n™~ rs\n“ EI e\n= a\n~\nS—\naa\n\nFeatures:\ne Anumber of repeaters are used and the transmission is unidirectional.\ne Adiate is transferred in a sequential manner that is bitten by bit.\nAdvantages:\ne Transmitting network is not affected by high traffic or by adding more nodes, as only the nodes\nhaving tokens can transmit data.\ne Cheap to install and expand.\nDisadvantages:\ne Troubleshooting is difficult in a ring topology.\ne Adding or deleting the computers disturbs the network activity.\ne Failure of one computer disturbs the whole network.\nStar Topology\ne In this type of topology, all the computers are connected to a single hub through a cable. This\nhub is the central node and all others nodes are connected to the central node.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 15\n"
    },
    {
      "page_number": "16",
      "content": "| <d Darsh an 1 — Introduction to Computer Networks & Internet\n\nFeatures:\ne Every node has its own dedicated connection to the hub.\ne Acts as a repeater for data flow.\ne Can be used with twisted pair, Optical Fibre or coaxial cable.\nAdvantages:\ne Fast performance with few nodes and low network traffic.\ne Hub can be upgraded easily.\ne Easy to troubleshoot.\ne Easy to set up and modify.\ne Only that node is affected which has failed rest of the nodes can work smoothly.\nDisadvantages:\ne Cost of installation is high.\ne Expensive to use.\ne If the hub is affected then the whole network is stopped because all the nodes depend on the\nhub.\ne Performance is based on the.\nMesh Topology\ne It is a point-to-point connection to other nodes or devices.\ne Traffic is carried only between two devices or nodes to which it is connected.\n\nLI Oo\noa _\nSe wwe\n\neee oN\n\n———|\n—\nFeatures:\ne Fully connected.\ne Robust.\n\ne Not flexible.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 16\n"
    },
    {
      "page_number": "17",
      "content": "e\n| Darsh an 1 - Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\nAdvantages:\ne Each connection can carry its own data load.\ne — Itis robust.\ne A fault is diagnosed easily.\ne Provides security and privacy.\nDisadvantages:\ne Installation and configuration are difficult.\ne Cabling cost is more.\ne = Bulk wiring is required.\nTree Topology\ne It has a root node and all other nodes are connected to it forming a hierarchy.\ne It is also called hierarchical topology.\ne It should at least have three levels to the hierarchy.\n\nFeatures:\ne Ideal if workstations are located in groups.\ne Used in Wide Area Network.\nAdvantages:\ne Extension of bus and star topologies.\ne Expansion of nodes is possible and easy.\ne Easily managed and maintained.\ne Error detection is easily done.\nDisadvantages:\ne Heavily cabled.\ne Costly.\ne If more nodes are added maintenance is difficult.\n\ne = Central hub fails then network fails.\nHybrid Topology\ne A network structure whose design contains more than one topology is said to be hybrid\ntopology.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 17\n"
    },
    {
      "page_number": "18",
      "content": "® ™\n7.\n: D Darsh an 1 — Introduction to Computer Networks & Internet\n\nology\n\ne For example, if in an office in one department ring topology is used and in another star,\ntopology is used, connecting these topologies will result in Hybrid Topology (ring topology and\nstar topology).\n\nStar\n\nFeatures:\n\ne It is a combination of two or more topologies\n\ne Inherits the advantages and disadvantages of the topologies included\nAdvantages:\n\ne Reliable as error detecting and troubleshooting is easy.\n\ne Scalable as size can be increased easily.\n\ne Flexible.\nDisadvantages:\n\ne Complex in design.\n\ne Costly.\n\nThe Network Core\ne Network core defines the connection of different network segments together and the process to\ntransmit the data packets across the network.\ne The network core is implemented through the use of switching techniques.\ne = The classification of a switching network is shown below:\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 18\n"
    },
    {
      "page_number": "19",
      "content": "&) Darshan\n\nInstitute of Engineering & Technology\n\nCircuit-Switched\nNetworks\n\nCircuit Switching\n\n1 — Introduction to Computer Networks & Internet\n\nSwitched\nNetworks\n\nPacket-Switched Message-Switched\nNetworks Networks\n\nDatagram Virtual-Circuit\nNetworks Networks\n\ne Circuit switching is used in public telephone networks and is the basis for private networks built\n\non leased-lines.\n\ne = Circuit switching was developed to handle voice traffic but also digital data (although inefficient)\ne =With circuit switching a dedicated path is established between two stations for communication.\n\ne Switching and transmission resources within the network are reserved for the exclusive use of\nthe circuit for the duration of the connection.\ne The connection is transparent: once it is established, it appears to attach devices as if there\n\nwere a direct connection.\n\ne Communication via circuit switching involves three phases:\n\n1. Circuit Establishment\n2. Data Transfer\n3. Circuit Disconnect\n\nTotal delay\n\noo\n\nDisconnect\n\nData transfer\n\nTime Time Time Time\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 19\n"
    },
    {
      "page_number": "20",
      "content": "D Darshan\n\niaehhe Of Snaineurtng ad Tochiseleny 1 — Introduction to Computer Networks & Internet\n\ne Connection path must be established before data transmission begins. Nodes must have\nswitching capacity and channel capacity to establish a connection.\n\ne = Circuit switching is inefficient\n\n1. Channel capacity dedicated for a duration of a connection\n\n2. If no data, capacity wasted\ne Set up (connection) takes time\ne Once connected, a transfer is transparent to the users\n\n1. Data is transmitted at a fixed data rate with no delay (except for the propagation delay)\ne Developed for voice traffic (phone)\n\n1. May also be used for data traffic via modem\n\ne Interconnection of telephones within a building or office.\n\ne In circuit switching, a direct physical connection between two devices is created by space-\ndivision switches, time-division switches, or both OR Circuit switching use any of below two\ntechnologies:\n\nSpace Division Switching\n\ne Ina space-division switch, the path from one device to another is spatially separate from other\npaths.\n\ne Developed for the analogue environment.\n\ne Acrossbar is the most common space-division switch. It connects n inputs to m outputs via n x\nm cross points.\n\ne Crossbar switch.\n\nTo control station\n\n20\n\nCrossbar Switch\n| il mow\n\nFigure 15: Space Division Switching\nTime Division Switching\ne Ina time-division switch, the inputs are divided in time, using TDM. A control unit sends the\n\ninput to the correct output device.\ne Use digital time division techniques to set up and maintain virtual circuits.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 20\n"
    },
    {
      "page_number": "21",
      "content": "e\nDar. sh an 1 - Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\n* Switching Techniques:\n* TSI (Time Slot\n\nInterchange)\n* TST (Time\nSpace Time)\n* TDM Bus\nb. Switching\nFigure 16: Time Division Switching\nPacket Switching\n\nPacket switching was designed to provide a more efficient facility than circuit-switching for burst\ndata traffic.\nWith packet switching, a station transmits data in small blocks, called packets.\nAt each node, packets are received, stored briefly (buffered) and passed on to the next node.\n1. Store and forward mechanism\nEach packet contains some portion of the user data plus control info needed for proper\nfunctioning of the network.\nA key element of packet-switching networks is whether the internal operation is datagram or\nvirtual circuit (VC).\n1. With internal VCs, a route is defined between two endpoints and all packets for that VC\nfollow the same route.\n2. With internal diagrams, each packet is treated independently, and packets intended for\nthe same destination may follow different routes.\nExamples of packet switching networks are X.25, Frame Relay, ATM and IP.\nStation breaks a long message into packets. Packets sent one at a time to the network.\nPackets handled in two ways:\n1. Datagram\n= Each packet treated independently\n= Packets can take any practical route\n= Packets may arrive out of order\n= Packets may go missing\n= Up to receiver to re-order packets and recover from missing packets\n2. Virtual Circuit\n= Pre-planned route established before any packets sent.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 21\n"
    },
    {
      "page_number": "22",
      "content": "e\n| Dar. sh qn 1 — Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\n= Once the route is established, all the packets between the two communicating\nparties follow the same route through the network\n\n= Call request and call accept packets to establish a connection (handshake)\n\n=\" Each packet contains a Virtual Circuit Identifier (VCI) instead of a destination\naddress\n\n= No routing decisions required for each packet\n\n= Clear request to drop circuit\n\n= Not a dedicated path\n\nMessage Switching\n\ne This technique was somewhere in the middle of circuit switching and packet switching.\n\ne In message switching, the whole message is treated as a data unit and is transferred in its\nentirety.\n\ne A switch working on message switching first receives the whole message and buffers it until\nthere are resources available to transfer it to the next hop.\n\ne If the next hop is not having enough resource to accommodate large size message, the message\nis stored and switch waits.\n\nProtocols layers and their service model\n\nOSI Layer Architecture\n\ne OSI model is based on a proposal developed by the International Standards Organization (ISO) as\nthe first step toward international standardization of the protocols used in the various layers.\n\ne It was revised in 1995.\n\ne The model is called the OSI (Open Systems Interconnection) Reference Model because it deals\nwith connecting open systems—that is, systems that are open for communication with other\nsystems.\n\ne The OSI model has seven layers.\n\n1. Physical Layer\nData Link Layer\nNetwork Layer\nTransport Layer\nSession Layer\nPresentation Layer\nApplication Layer\n\nNOUR WN\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 22\n"
    },
    {
      "page_number": "23",
      "content": "CD Darshan\n\nasesuée ot Encinaectug ak reohsokes 1 — Introduction to Computer Networks & Internet\n\nLayer Name of unit\nexchanged\nae Application protocol ae:\n7 Application |~------------------------------------ =| Application | APDU\nr r\nInterface |\n6 | Presentation |}~----------- RBS ONtA NON PIO CON nee *| Presentation | PPDU\nry A\ny Bedi y\n5 Session ct LL =| Session SPDU\n\nCommunication subnet boundary\n\nTransport TPDU\n\nY Internal subnet protocol\n\nESS\n4\n=\n»\n=|\na\nZU\n°\n=\n4\n=|\n2\n=]\na\nue]\n°\na\na\n°\n~\nQ\nQ\n2\nY\n< -\n\n3 Network Je-3 | Network 2 Network |- --*| Network | Packet\n’ ry\ny y\n\n2 Data link _- Data link |. Datalink j|«+--»| Datalink Frame\nry ry\ny y\n\n1 Physical |~, Physical J=——te Physical | --*| Physical | Bit\n\nHost A Router Router Host B\n\nNetwork layer host-router protocol\nData link layer host-router protocol\nPhysical layer host-router protocol\n\nFigure 17: OSI Reference Model\n\nPhysical Layer\n\ne The physical layer, the lowest layer of the OSI model, is concerned with the transmission and\nreception of the unstructured raw bit stream over a physical medium.\n\ne It describes the electrical/optical, mechanical, and functional interfaces to the physical medium,\nand carries the signals for all of the higher layers. It provides:\n\ne Data encoding: modifies the simple digital signal pattern (1s and Os) used by the PC to better\naccommodate the characteristics of the physical medium, and to aid in a bit and frame\nsynchronization.\n\ne Transmission technique: determines whether the encoded bits will be transmitted by baseband\n(digital) or broadband (analog) signalling.\n\ne Physical medium transmission: transmits bits as electrical or optical signals appropriate for the\nphysical medium.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 23\n"
    },
    {
      "page_number": "24",
      "content": "D Darshan\n\nasesuée ot Encinaectug ak reohsokes 1 — Introduction to Computer Networks & Internet\n\nData link Layer\n\nThe data link layer provides error-free transfer of data frames from one node to another over\nthe physical layer, allowing layers above it to assume virtually error-free transmission over the\nlink.\n\nTo do this, the data link layer provides:\n\nLink establishment and termination: establishes and terminates the logical link between two\nnodes.\n\nFrame traffic control: tells the transmitting node to \"back-off\" (stop) when no frame buffers are\navailable.\n\nFrame sequencing: transmits/receives frames sequentially.\n\nFrame acknowledgment: provides/expects frame acknowledgments. Detects and recovers from\nerrors that occur in the physical layer by retransmitting non-acknowledged frames and handling\nduplicate frame receipt.\n\nFrame delimiting: creates and recognizes frame boundaries.\n\nFrame error checking: checks received frames for integrity.\n\nMedia access management: determines when the node \"has the right\" to use the physical\nmedium.\n\nNetwork Layer\n\nThe network layer controls the operation of the subnet, deciding which physical path the data\nshould take based on network conditions, a priority of service, and other factors.\n\nTo do this, the data link layer provides:\n\nRouting: routes frames among networks.\n\nSubnet traffic control: routers (network layer intermediate systems) can instruct a sending\nstation to \"throttle back\" its frame transmission when the router's buffer fills up.\n\nFrame fragmentation: if it determines that a downstream router's maximum transmission unit\n(MTU) size is less than the frame size, a router can fragment a frame for transmission and re-\nassembly at the destination station.\n\nLogical-physical address mapping translates logical addresses or names, into physical addresses.\nSubnet usage accounting: has accounting functions to keep track of frames forwarded by\nsubnet intermediate systems, to produce billing information.\n\nTransport Layer\n\nThe transport layer ensures that messages are delivered error-free, in sequence, and with no\nlosses or duplications. It relieves (release) the higher layer protocols from any concern with the\ntransfer of data between them and their peers.\n\nThe size and complexity of a transport protocol depend on the type of service it can get from the\nnetwork layer. For a reliable network layer with virtual circuit capability, a minimal transport\nlayer is required. If the network layer is unreliable and/or only supports datagrams, the\ntransport protocol should include extensive error detection and recovery.\n\nThe transport layer provides:\n\nMessage segmentation: accepts a message from the (session) layer above it, splits the message\ninto smaller units (if not already small enough), and passes the smaller units down to the\nnetwork layer. The transport layer at the destination station reassembles the message.\n\nMessage acknowledgment: provides reliable end-to-end message delivery with\nacknowledgments.\n\nProf. Maulik Trivedi, CE Department | 2140709 - Computer Networks (CN) 24\n"
    },
    {
      "page_number": "25",
      "content": "eo\n| Dar. sh qn 1 — Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\nMessage traffic control: tells the transmitting station to \"back-off\" when no message buffers are\navailable.\n\nTypically, the transport layer can accept relatively large messages, but there are strict message\nsize limits imposed by the network (or lower) layer. Consequently, the transport layer must\nbreak up the messages into smaller units, or frames, prepending a header to each frame.\n\nThe transport layer header information must then include control information, such as message\nstart and message end flags, to enable the transport layer on the other end to recognize\nmessage boundaries.\n\nIn addition, if the lower layers do not maintain sequence, the transport header must contain\nsequence information to enable the transport layer on the receiving end to get the pieces back\ntogether in the right order before handing the received message up to the layer above.\n\nSession Layer\n\nThe session layer allows session establishment between processes running on different stations.\nIt provides:\n\nSession establishment, maintenance, and termination: allows two application processes on\ndifferent machines to establish, use and terminate a connection, called a session.\n\nSession support: performs the functions that allow these processes to communicate over the\nnetwork, performing security, name recognition, logging, and so on.\n\nPresentation Layer\n\nThe presentation layer formats the data to be presented to the application layer. It can be\nviewed as the translator for the network. This layer may translate data from a format used by\nthe application layer into a common format at the sending station, then translate the common\nformat to a format known to the application layer at the receiving station.\n\nThe presentation layer provides:\n\nCharacter code translation: for example, ASCII to EBCDIC.\n\nData conversion: bit order, CR-CR/LF, integer-floating point, and so on.\n\nData compression reduces the number of bits that need to be transmitted on the network.\n\nData encryption: encrypt data for security purposes. For example, password encryption.\n\nApplication Layer\n\nThe application layer serves as the window for users and application processes to access\n\nnetwork services.\n\nThis layer contains a variety of commonly needed functions:\n1. Resource sharing and device redirection\n\nRemote file access\n\nRemote printer access\n\nInter-process communication\n\nNetwork management\n\nDirectory services\n\nElectronic messaging (such as mail)\n\n8 Network virtual terminals\n\nNOUR WN\n\nTCP/IP Reference Model (Internet Protocol Stack layers)\n\nTransmission Control Protocol/Internet Protocol (TCP/IP) protocol suite is the engine for the\nInternet and networks worldwide.\nTCP/IP either combines several OSI layers into a single layer or does not use certain layers at all.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 25\n"
    },
    {
      "page_number": "26",
      "content": "DD Var nee rshan 1 — Introduction to Computer Networks & Internet\n\ne TCP/IP is a set of protocols developed to allow cooperating computers to share resources across\nthe network.\ne The TCP/IP model has five layers.\n1. Application Layer\n2. Transport Layer\n3. Internet Layer\n4. Data Link Layer\n5. Physical Network\n\nTCP/IP model Protocols and services OSI model\n\nHTTP, FTTP, ene ean\nApplication Telnet, NTP,\nDHCP, PING\n\n[_Trenspot_J cP, uoP Transport\nIP, ARP, ICMP, ICMP Network\n\nSsssceeeteeeeeseettesssstssnnenennsenee Data Link\nPhysical\n\nNetwork\nona Ethernet\n\nInterface\n\nFigure 18: TCP/IP Reference Model\n\ne As we can see from the above figure, the presentation and session layers are not there in the\nTCP/IP model. Also, note that the Network Access Layer in the TCP/IP model combines the\nfunctions of Data link Layer and Physical Layer.\n\nApplication Layer\n\ne The application layer is the topmost layer of the four-layer TCP/IP model.\n\ne The application layer is present on the top of the Transport layer.\n\ne Application layer defines TCP/IP application protocols and how host programs interface with\nTransport layer services to use the network.\n\ne Application layer includes all the higher-level protocols like DNS (Domain Naming System), HTTP\n(Hypertext Transfer Protocol), Telnet, SSH, FTP (File Transfer Protocol), TFTP (Trivial File Transfer\nProtocol), SNMP (Simple Network Management Protocol), SMTP (Simple Mail Transfer Protocol),\nDHCP (Dynamic Host Configuration Protocol), X Windows, RDP (Remote Desktop Protocol) etc.\n\nTransport Layer\n\ne The purpose of the Transport layer is to permit devices on the source and destination hosts to\ncarry on a conversation.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 26\n"
    },
    {
      "page_number": "27",
      "content": "eo\n| Dar. sh qn 1 — Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\nTransport layer defines the level of service and status of the connection used when transporting\ndata.\n\nThe transport layer provides the end-to-end data transfer by delivering data from an application\nto its remote peer.\n\ne The most-used transport layer protocol is the Transmission Control Protocol (TCP), which\n\nprovides:\n> Reliable delivery data > Congestion control\n> Duplicate data suppression > Flow control\ne Another transport layer protocol is the User Datagram Protocol (UDP), which provides:\n> Connectionless > Best-effort service\n\n\\\n\n> Unreliable\n\ne UDP is used by applications that need a fast transport mechanism and can tolerate the loss of\nsome data.\n\nNetwork Layer (Internet Layer)\n\ne The internet layer also called the network layer.\n\ne Internet layer pack data into data packets known as IP datagrams, which contain source and\ndestination address (logical address or IP address) information that is used to forward the\ndatagrams between hosts and across networks.\n\ne The Internet layer is also responsible for the routing of IP datagrams.\n\ne Internet Protocol (IP) is the most important protocol in this layer.\n\ne It is a connectionless protocol that does not assume reliability from lower layers. IP does not\nprovide reliability, flow control or error recovery.\n\ne IP provides a routing function that attempts to deliver transmitted messages to their\n\ndestination.\n\ne These message units in an IP network are called an IP datagram.\n\ne Example: IP, ICMP, IGMP, ARP, and RARP.\n\nNetwork Interface Layer (Network Access Layer)\n\ne Network Access Layer defines details of how data is physically sent through the network,\nincluding how bits are electrically or optically signalled by hardware devices that interface\ndirectly with a network medium, such as coaxial cable, optical fiber, or twisted pair copper wire.\n\ne The protocols included in Network Access Layer are Ethernet, Token Ring, FDDI, X.25, Frame\nRelay etc.\n\nTCP/IP (Transmission Control Protocol /\n\nOSI (Open System Interconnection) Internet Protocol)\n\ne It has 7 layers e Ithas 4 layers\ne OSI provides layer functioning and also defines | e TCP/IP model is more based on protocols\nfunctions of all the layers. and protocols are not flexible with other\nlayers.\ne Inthe OSI model, the transport layer e Inthe TCP/IP model, the transport layer\nguarantees the delivery of packets does not guarantee delivery of packets.\ne Follows horizontal approach e Follows a vertical approach.\ne OSI model has a separate presentation layer e TCP/IP doesn’t have a separate presentation\nlayer\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 27\n"
    },
    {
      "page_number": "28",
      "content": "D Darshan\n\niaehhe Of Snaineurtng ad Tochiseleny 1 — Introduction to Computer Networks & Internet\n\ne OSI is a general model. e TCP/IP model cannot be used in any other\napplication.\ne The network layer of the OSI model provides e The Network layer in the TCP/IP model\nboth connection-oriented and connectionless provides connectionless service.\nservice.\ne OSI model has a problem of fitting the e TCP/IP model does not fit any protocol\n\nprotocols in the model\ne Protocols are hidden in the OSI model and are e In TCP/IP replacing protocol is not easy.\neasily replaced as the technology changes.\ne OSI model defines services, interfaces, and e In TCP/IP, it is not clearly separated its\nprotocols very clearly and makes a clear services, interfaces, and protocols.\ndistinction between them.\n\nUnderstanding of Delay, Loss, and Throughput in the Packet Switching\nNetwork\n\nBasics\n= Recall that a packet starts in a host (the source), passes through a series of routers, and ends its\njourney in another host (the destination).\n= As a packet travels from one node (host or router) to the subsequent node (host or router)\nalong this path, the packet suffers from several types of delays at each node along the path.\n= The most important of these delays are the\n> Nodal processing delay > Transmission delay\n> Queuing delay > Propagation delay\n= Together, these delays accumulate to give a total nodal delay.\n= The performance of many Internet applications—such as search, Web browsing, email, maps,\ninstant messaging, and voice-over-IP—are greatly affected by network delays.\n\nB\n\nPaes\n\n—f\n\nT\nPropagation\n\nNodal Queueing Transmission\nprocessing (waiting for\ntransmission)\n\nFigure 19: Delay in Packet Switched Network\n\nProcessing Delay\ne The time required to examine the packet’s header and determine where to direct the packet is\npart of the processing delay.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 28\n"
    },
    {
      "page_number": "29",
      "content": "eo\n| Dar. sh qn 1 — Introduction to Computer Networks & Internet\n\nInstitute of Engineering & Technology\n\nThe processing delay can also include other factors, such as the time needed to check for bit-\nlevel errors in the packet that occurred in transmitting the packet's bits from the upstream node\nto the router.\n\nIt is typically on the order of microseconds or less.\n\nQueuing Delay\n\nAt the queue, the packet experiences a queuing delay as it waits to be transmitted onto the link.\nThe length of the queuing delay of a specific packet will depend on the number of earlier-\narriving packets that are queued and waiting for transmission onto the link.\n\nIf the queue is empty and no other packet is currently being transmitted, then our packet’s\nqueuing delay will be zero.\n\nOn the other hand, if the traffic is heavy and many other packets are also waiting to be\ntransmitted, the queuing delay will be long.\n\nQueuing delays can be on the order of microseconds to milliseconds in practice.\n\nTransmission Delay\n\nAssuming that packets are transmitted in a first-come-first-served manner like packet-switched\nnetworks.\n\nNow packet can be transmitted only after all the packets that have arrived before it have been\ntransmitted.\n\nDenote the length of the packet by L bits, and denote the transmission rate of the link from a\nrouter to a router by R bits/sec.\n\nThe transmission delay is L/R.\n\nTransmission delays are typically on the order of microseconds to milliseconds in practice.\n\nPropagation Delay\n\nPacke\n\nOnce a bit is pushed into the link, it needs to propagate to router B. The time required to\npropagate from the beginning of the link to router B is the propagation delay.\n\nThe bit propagates at the propagation speed of the link.\n\nThe propagation speed depends on the physical medium of the link.\n\nPropagation delays are on the order of milliseconds.\n\nPropagations delay=d (Length of Physical Link) /s (Propagation speed in medium).\n\nt Loss\n\nPacket loss is the failure of one or more transmitted packets to arrive at their destination.\n\nThis event can cause noticeable effects on all types of digital communications.\n\nThe loss of data packets depends on the switch queue. The loss of data packets increases with\nthe increases in the traffic intensity.\n\nIt affects the performance of the network.\n\nThroughput\n\nThroughput or Network Throughput is the rate of successful message delivery over a\ncommunication channel.\n\nThe data these messages belong to may be delivered over a physical or logical link or it can pass\nthrough a certain network node.\n\nThroughput is usually measured in bits per second (bit/s or bps), and sometimes in data packets\nper second (p/s or pps) or data packets per time slot.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 29\n"
    },
    {
      "page_number": "30",
      "content": "eo\nDarsh qn 1 — Introduction to Computer Networks & Internet\n\nProblem:\n\nIn this problem, we consider sending real-time voice from Host A to Host B over a packet-\nswitched network (VoIP). Host A converts analog voice to a digital 64 kbps bit stream on the\nfly. Host A then groups the bits into 56-byte packets. There is one link between Hosts A and\nB; its transmission rate is 2 Mbps and its propagation delay is 10 msec. As soon as Host A\ngathers a packet, it sends it to Host B. As soon as Host B receives an entire packet, it converts\nthe packet's bits to an analog signal. How much time elapses from the time a bit is created\n(from the original analog signal at Host A) until the bit is decoded (as part of the analog\nsignal at Host B)?\n\nHost A rH Host B\n\nGiven:\n\nAnalog to Digital conversion rate = 64 kbps\n\nPacket size = 56 bytes (Convert into bits so 56 bytes = 56 * 8 = 448 bits).\nTransmission rate = 2 Mbps\n\nPropagation delay = 10 msec\n\nVVVV\n\ne Since this is a packet switched network, the data will be transmitted packet by packet.\n\ne A packet is 56 byte and the analog to digital conversation rate is 64 kbps, thus the preparing\ntime\nPT for a packet is 448/(64*1000)= 0.007 sec = 7 msec\n\ne The transition delay TD for a packet is (Size or Length of packet) / (Speed or Transmission rate)\nSo, TD = (56*8) / (2*1000*1000) =0.000224 s = 0.224msec.\n\ne Propagation delay PD = 10msec (Given in sum)\n\ne Finally, the total time elapses from the time a bit is create until the bit is decoded is PT+TD+PD=\n7+0.224+10 = 17.224 msec.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 30\n"
    }
  ]
}