{
  "chapter_name": "5: The Link layer and Local area networks",
  "pages": [
    {
      "page_number": "1",
      "content": "Darshan\n\nasad of Engtueuctag a Teckoolsgy 5 — The Link layer and Local area networks\n\nThe Services Provided by the Link Layer\n\ne Framing: Almost all link-layer protocols encapsulate each network-layer datagram within a\nlink-layer frame before transmission over the link. The structure of the frame is specified by\nthe link-layer protocol.\n\ne Link access: A medium access control (MAC) protocol specifies the rules by which a frame is\ntransmitted onto the link. For point-to-point links that have a single sender at one end of the\nlink and a single receiver at the other end of the link, the MAC protocol is simple the sender\ncan send a frame whenever the link is idle. The more interesting case is when multiple nodes\nshare a single broadcast link - the so-called multiple access problem.\n\ne Reliable delivery: When a link-layer protocol provides reliable delivery service, it guarantees\nto move each network-layer datagram across the link without error. A link-layer reliable\ndelivery service can be achieved with acknowledgments and retransmissions.\n\ne Error detection and correction: The link-layer hardware in a receiving node can incorrectly\ndecide that a bit in a frame is zero when it was transmitted as a one, and vice versa. Such bit\nerrors are introduced by signal attenuation and electromagnetic noise. Because there is no\nneed to forward a datagram that has an error, many link-layer protocols provide a\nmechanism to detect such bit errors. This is done by having the transmitting node include\nerror-detection bits in the frame, and having the receiving node perform an error check.\n\nWhere is the link layer implemented?\ne It is implemented in each and every host.\ne = The link layer is implemented in a network adapter, also sometimes known as a network\ninterface card (NIC).\n\nHost\nApplication\nTransport\nNetwork\n| Link\n: : ~ Host bus\n(e.g., PCI)\n\nController\n\n— Network adapter\nPhysical\nPhysical\ntransmission\n\nFig. 1: Network adapter: its relationship to other host components and to protocol stack\nfunctionality\ne Figure 1 shows a network adapter attaching to a host’s bus (e.g., a PCI or PCI-X bus), where it\nlooks much like any other I/O device to the other host components.\ne Figure 1 also shows that while most of the link layer is implemented in hardware, part of the\nlink layer is implemented in software that runs on the host’s CPU.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 1\n"
    },
    {
      "page_number": "2",
      "content": "@\nDar. sh qn 5 — The Link layer and Local area networks\n\nInstitute of Engineering & Technology\n\ne The software components of the link layer implement higher-level link layer functionality\nsuch as assembling link-layer addressing information and activating the controller hardware.\n\ne On the receiving side, link-layer software responds to controller interrupts (e.g., due to the\nreceipt of one or more frames), handling error conditions and passing a datagram up to the\nnetwork layer.\n\ne Thus, the link layer is a combination of hardware and software-the place in the protocol\nstack where software meets hardware.\n\nError Detection and Correction Techniques\n\ne Techniques for error detection\n1. parity checks\n2. checksum methods\n3. cyclic redundancy checks\nParity checks\ne Inthis technique, a redundant bit called parity bit, is appended to every data unit so that the\nnumber of 1s in the unit including the parity becomes even.\ne Blocks of data from the source are subjected to a check bit or Parity bit generator form,\nwhere a parity of 1 is added to the block if it contains an odd number of 1’s and 0 is added if\nit contains an even number of 1’s.\ne At the receiving end the parity bit is computed from the received data bits and compared\nwith the received parity bit.\ne This scheme makes the total number of 1’s even, that is why it is called even parity checking.\n\nSender Receiver\nAccept Data\nData Y\n101101\nReject Data\n| N\nCompute\nparity bit Compute\nparity bit\n101101 | 1 101101 | 1\nTransmission\nMedia\nFig. 2: Even parity checking scheme\nPerformance\n\ne Areceiver can detect all single bit errors in each code word.\ne Errors in more than one bit cannot be detected.\nTwo-dimension Parity Check\ne Performance can be improved by using two-dimensional parity check, which organizes the\nblock of bits in the form of a table.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 2\n"
    },
    {
      "page_number": "3",
      "content": "Darshan\n\nasad of Engtueuctag a Teckoolsgy 5 — The Link layer and Local area networks\n\ne Parity check bits are calculated for each row, which is equivalent to a simple parity check bit.\ne Parity check bits are also calculated for all columns then both are sent along with the data.\ne Atthe receiving end these are compared with the parity bits calculated on the received data.\n\nOriginal 10110011 [10101011 [01011010 |11010101\n\n10110011 | 1\n\n10101011 | 1 Row parities\n\n01011010 | O\n11010101 | 1\n\nData to be sent 101100111] 101010111]010110100] 110101011 | 100101111\n\nColumn parities\n\nFig. 3: Two-dimensional parity check\n\nPerformance\n\ne Two- Dimension Parity Checking increases the likelihood of detecting burst errors.\n\ne 2-D Parity check of n bits can detect a burst error of n bits.\n\ne A burst error of more than n bits is also detected by 2-D Parity check with a high-probability.\n\ne If two bits in one data unit are damaged and two bits in exactly same position in another\ndata unit are also damaged, the 2-D Parity check checker will not detect an error.\n\nChecksum\n\ne Here, the data is divided into k segments each of m bits.\n\ne Inthe sender’s end the segments are added using 1’s complement arithmetic to get the sum.\n\ne The sum is complemented to get the checksum.\n\ne The checksum segment is sent along with the data segments.\n\ne At the receiver’s end, all received segments are added using 1’s complement arithmetic to\nget the sum. The sum is complemented.\n\ne Ifthe result is zero, the received data is accepted; otherwise discarded.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 3\n"
    },
    {
      "page_number": "4",
      "content": "Darshan\n\nIaieieaed of Engineering a Tachactogy 5 — The Link layer and Local area networks\n\nReceived data\n\nk=4, m=8 10110011\n10110011 10101011\n10101011 01011110\n01011110 —e 1\n\nane 1 01011111\n01011111 01011010\n01011010 10111001\n10111001 11010101\n11010101 10001110\n\n<, 10001110 <=, 1\n1 10001111\n\nSum: 10001111 01110000\nComplement: | 01110000 Sum: 11111111\nComplement: 00000000\n\nFig. 4: Checksum\n\nPerformance\n\nThe checksum detects all errors involving an odd number of bits.\nIt also detects most errors involving even number of bits.\n\nCyclic Redundancy Checks (CRC)\n\nCRC is the most powerful and easy to implement technique.\n\nCRC is based on binary division.\n\nIn CRC, a sequence of redundant bits, are appended to the end of data unit so that the\nresulting data unit becomes exactly divisible by a second, predetermined binary number.\n\nAt the destination, the incoming data unit is divided by the same number.\n\nIf at this step there is no remainder, the data unit is assumed to be correct and is therefore\naccepted.\n\nA remainder indicates that the data unit has been damaged in transit and therefore must be\nrejected.\n\nThe binary number, which is (r+1) bit in length, can also be considered as the coefficients of\na polynomial, called Generator Polynomial.\n\nPerformance\n\nCRC is a very effective error detection technique.\n\nIf the divisor is chosen according to the previously mentioned rules, its performance can be\nsummarized as follows\n\nCRC can detect all single-bit errors\n\nCRC can detect all double-bit errors (three 1’s)\n\nCRC can detect any odd number of errors (X+1)\n\nCRC can detect all burst errors of less than the degree of the polynomial.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 4\n"
    },
    {
      "page_number": "5",
      "content": "@\nDar. sh an 5 — The Link layer and Local area networks\n\nInstitute of Engineering & Technology\n\nSender a Receiver\n: Vv\nm n bits Data CRC\nData 00...0\n~ 7 n+1 bits\n{| n+1 bits _.\nDivisor\nDivisor\nbi \\Z\nn bits Remainder\nCRC\noe Y N\nAccept Reject\n—> Data CRC\n\nFig. 5: Basic scheme for Cyclic Redundancy Check\n\nFrame : 1101011011\nGenerator: 10011\nMessage after appending 4 zero bits: 11010110000\n\n1100001010\n10011/11010110110000\n10011\n\n10011\n10011\n\n00001\n00000\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 5\n"
    },
    {
      "page_number": "6",
      "content": "Darshan\n\nasad of Engtueuctag a Teckoolsgy 5 — The Link layer and Local area networks\n\nFrame >: 1101011011\nGenerator; 10011\nMessage after appending 4 zero bits: 11010110000\n\n1100001010\n10011]11010110110000\n\n10100\n1oo1t\n\n01110\n0 4 ; a ae Remainder\n\nTransmitted frame: 11010110111110\n\nMultiple access links and protocols\ne There are two types of network links:\n\n1. A point-to-point link consists of a single sender at one end of the link and a single\nreceiver at the other end of the link.\n\n2. A broadcast link, can have multiple sending and receiving nodes all connected to the\nsame, single, shared broadcast channel. The term broadcast is used here because\nwhen any one node transmits a frame, the channel broadcasts the frame and each\nof the other nodes receives a copy.\n\ne Multiple access problem: How to coordinate the access of multiple sending and receiving to\na shared broadcast channel.\n\ne In broadcast link all nodes are capable of transmitting frames, more than two nodes can\ntransmit frames at the same time.\n\ne When this happens, all of the nodes receive multiple frames at the same time; that is, the\ntransmitted frames collide at all of the receivers.\n\ne When there is a collision, none of the receiving nodes can make any sense of any of the\nframes that were transmitted; in a sense, the signals of the colliding frames become\ninextricably tangled together.\n\ne Thus, all the frames involved in the collision are lost, and the broadcast channel is wasted\nduring the collision interval.\n\ne If many nodes want to transmit frames frequently, many transmissions will result in\ncollisions, and much of the bandwidth of the broadcast channel will be wasted.\n\ne In order to ensure that the broadcast channel performs useful work when multiple nodes\nare active, it is necessary to somehow coordinate the transmissions of the active nodes.\n\ne This coordination job is the responsibility of the multiple access protocol.\n\nMultiple Access Protocols\ne Categories of Multiple Access Protocol:\n1. channel partitioning protocols\n> divide channel into smaller “pieces” (time slots, frequency, code)\n> allocate piece to node for exclusive use\n> Examples of channel partitioning protocols\n1. TDMA: Time Division Multiple Access\n2. FDMA: Frequency Division Multiple Access\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 6\n"
    },
    {
      "page_number": "7",
      "content": "Darshan\n\nasad of Engtueuctag a Teckoolsgy 5 — The Link layer and Local area networks\n\n3. CDMA: Code Division Multiple Access\n2. random access protocols\n> channel not divided and allow collisions\n> “recover” from collisions\n> examples of random access MAC (Medium Access Control) protocols\n1. ALOHA\n2. slotted ALOHA\n3. CSMA, CSMA/CD, CSMA/CA\n3. taking-turns protocols\n> nodes take turns but nodes with more to send can take longer turns\n> examples of taking-turns protocols\n1. polling\n2. token passing\n\nTDMA: Time Division Multiple Access\n\nSuppose the channel supports N nodes and that the transmission rate of the channel is R\nbps.\n\nTDM divides time into time frames and further divides each time frame into N time slots.\nEach time slot is then assigned to one of the N nodes. Whenever a node has a packet to\nsend, it transmits the packet’s bits during its assigned time slot in the revolving TDM frame.\nTypically, slot sizes are chosen so that a single packet can be transmitted during a slot time.\n\nTOM\na\n\nSlot Frame\n\nKey.\n\n[| slots labeled \"2\" are dedicated\n\nspecific sondersocaiver pair\n\nTDM is attractive because it eliminates collisions and is perfectly fair: Each node gets a\ndedicated transmission rate of R/N bps during each frame time.\n\nHowever, it has two major drawbacks. First, a node is limited to an average rate of R/N bps\neven when it is the only node with packets to send.\n\nA second drawback is that a node must always wait for its turn in the transmission sequence\nagain, even when it is the only node with a frame to send.\n\nFDMA: Frequency Division Multiple Access\n\nFDM divides the R bps channel into different frequencies (each with a bandwidth of R/N)\nand assigns each frequency to one of the N nodes.\n\nFDM thus creates N smaller channels of R/N bps out of the single, larger R bps channel.\n\nFDM shares both the advantages and disadvantages of TDM.\n\nIt avoids collisions and divides the bandwidth fairly among the N nodes.\n\nFDM also shares a principal disadvantage with TDM - a node is limited to a bandwidth of\nR/N, even when it is the only node with packets to send.\n\na\n\n2 E Link\naxie{\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 7\n"
    },
    {
      "page_number": "8",
      "content": "Darshan\n\nasad of Engtueuctag a Teckoolsgy 5 — The Link layer and Local area networks\n\nCDMA: Code Division Multiple Access\n\ne While TDM and FDM assign time slots and frequencies, respectively to the nodes, CDMA\nassigns a different code to each node.\n\ne Each node then uses its unique code to encode the data bits it sends.\n\ne If the codes are chosen carefully, CDMA networks have the wonderful property that\ndifferent nodes can transmit simultaneously and yet have their respective receivers correctly\nreceive a sender’s encoded data bits in spite of interfering transmissions by other nodes.\n\ne CDMA has been used in military systems for some time and now has widespread civilian use,\nparticularly in cellular telephony.\n\ne Because CDMA’s use is so tightly tied to wireless channels.\n\ne = It will suffice to know that CDMA codes, like time slots in TDM and frequencies in FDM, can\nbe allocated to the multiple access channel users.\n\nPure ALOHA and Slotted ALOHA Protocol\nPure ALOHA\n\ne Pure ALOHA allows users to transmit whenever they have data to be sent.\n\ne Senders wait to see if a collision occurred (after whole message has been sent).\n\ne = If collision occurs, each station involved waits a random amount of time then tries again.\n\ne Systems in which multiple users share a common channel in a way that can lead to conflicts\nare widely known as contention systems.\n\nStation 1\n\nStation 2\n\nrr\nsaons GM mm  —ei(i‘iU [Famesz]\n\nStation4 as... ----------- ra\n(ee Time\nCollision Collision\nduration duration\n\nFig. 6: In pure ALOHA, frames are transmitted at completely arbitrary times\n\ne Whenever two frames try to occupy the channel at the same time, there will be a collision\nand both will be garbled.\n\ne = If the first bit of a new frame overlaps with just the last bit of a frame almost finished, both\nframes will be totally destroyed and both will have to be retransmitted later.\n\nWhat is the efficiency of an ALOHA channel?\n\ne Let the \"frame time\" denote the amount of time needed to transmit the standard, fixed-\nlength frame.\n\ne Also assume that the infinite population of users generates new frames with mean N frames\nper frame time.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 8\n"
    },
    {
      "page_number": "9",
      "content": "Darshan\n\nIaieieaed of Engineering a Tachactogy 5 — The Link layer and Local area networks\n\nIf N > 1, the user community is generating frames at a higher rate than the channel can\nhandle, and nearly every frame will suffer a collision. For reasonable throughput we would\nexpectO<N<1.\nLet us further assume that the probability of k transmission attempts per frame time, old\nand new combined, is also Poisson, with mean G per frame time.\nUnder all loads, the throughput, S, is just the offered load, G, times the probability, Po, of a\ntransmission succeeding-that is, S = GPo, where Po is the probability that a frame does not\nsuffer a collision.\nThe probability that k frames are generated during a given frame time is given by the\nGke-G\n\nk!\nThe maximum throughput occurs at G = 0.5, with S = 1/2e, which is about 0.184.\n\nPoisson distribution: Pr[k] =\n\nSlotted ALOHA\n\nStation 1 |\nStation 2 |\nStation 3 |\nStation 4 a |\n\nSlotted ALOHA was invented to improve the efficiency of pure ALOHA as chances of collision\nin pure ALOHA are very high.\n\nIn slotted ALOHA, the time of the shared channel is divided into discrete intervals called\nslots.\n\nThe stations can send a frame only at the beginning of the slot and only one frame is sent in\neach slot.\n\nIn slotted ALOHA, if any station is not able to place the frame onto the channel at the\nbeginning of the sloti.e. it misses the time slot then the station has to wait until the\n\nbeginning of the next time slot.\nCollision Collision\n\nduration — duration\n\nF=___[Fremett | _____e\n>\n\nae el\n\n= |---| —____ _ Bee\nEe\n\na\n\nSlot 1 Slot2 Slot 3 Slot 4 Slot 5 Slot 6\nFig. 7: Frames transmitted in Slotted ALOHA\n\nWhat is the efficiency of an ALOHA channel?\n\nPure ALOHA > S = Ge?\n\nSlotted ALOHA > S=Ge®\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 9\n"
    },
    {
      "page_number": "10",
      "content": "Darshan\n\nasad of Engtueuctag a Teckoolsgy 5 — The Link layer and Local area networks\n\nnee Slotted ALOHA: S = Ge-S\n\n0.30\n\n0.20\n0.10 Pure ALOHA: S$ = Ge-#4\n\nS (throughput per frame time)\n\n[°) 0.5 1.0 1.5 2.0 3.0\nG (attempts per packet time)\nFig. 8: Throughput versus offered traffic for ALOHA systems\n\ne As seen in figure both graphs have the same shape. If G is small so is S, which means that if\nfew frames are generated few frames will be transmitted successfully.\n\ne As G increases so does S but up to a certain point. As G continues to increase S approaches\nto 0 which means that if more frames are generated there will be more collisions and the\nsuccess rate will fall to 0.\n\ne Similarly for pure ALOHA the maximum occurs at G=0.5 for which S = 1/2e = 0.184 which\nmeans the rate of successful transmissions is approximately 18.4%.\n\ne As seen from the graph the maximum for slotted ALOHA occurs at G=1 for which\nS=1/e=0.368. In other words the rate of successful transmissions is approximately 0.368\nframes per slot time or 37% of the time will be spent on successful transmissions.\n\nAdvantages of Slotted Aloha\n\ne Asingle active node can continuously transmit at full rate of channel.\n\ne Slotted ALOHA is also highly decentralized, because each node detects collisions and\nindependently decides when to retransmit.\n\ne Slotted ALOHA is also an extremely simple protocol.\n\nDisadvantages of Slotted Aloha\n\ne When there are multiple active nodes, a certain fraction of the slots will have collisions and\nwill therefore be wasted.\n\ne idle slots\n\ne nodes may be able to detect collision in less than time to transmit packet\n\ne clock synchronization\n\nCSMA (Carrier Sense Multiple Access) Protocols\n\ne Protocols in which stations listen for a carrier (i.e., a transmission) and act accordingly are\ncalled carrier sense protocols.\n\ne There are various CSMA protocol:\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 10\n"
    },
    {
      "page_number": "11",
      "content": "Darshan\n\nnea of Encinmestag & Teahsalog) 5 — The Link layer and Local area networks\n\n1. 1-persistent CSMA 3. p-persistent CSMA\n2. Non persistent COMA 4. CSMA/CD (CSMA with Collision Detection)\n\n1-persistent CSMA\n\nWhen a station has data to send, it first listens to the channel to see if anyone else is\ntransmitting at that moment.\n\nIf the channel is busy, the station waits until it becomes idle.\n\nWhen the station detects an idle channel, it transmits a frame. If a collision occurs, the station\nwaits a random amount of time and starts all over again.\n\nThe protocol is called 1-persistent because the station transmits with a probability of 1 when it\nfinds the channel idle.\n\nThe propagation delay has an important effect on the performance of the protocol.\n\nThere is a small chance that just after a station begins sending, another station will become\nready to send and sense the channel.\n\nIf the first station's signal has not yet reached the second one, the latter will sense an idle\nchannel and will also begin sending, resulting in a collision.\n\nThe longer the propagation delay, the more important this effect becomes, and the worse the\nperformance of the protocol.\n\nEven if the propagation delay is zero, there will still be collisions.\n\nIf two stations become ready in the middle of a third station's transmission, both will wait\npolitely until the transmission ends and then both will begin transmitting exactly simultaneously,\nresulting in a collision.\n\nIf they were not so impatient, there would be fewer collisions.\n\nNon persistent COMA\n\nIn this protocol, a conscious attempt is made to be less greedy than in the previous one.\n\nBefore sending, a station senses the channel. If no one else is sending, the station begins doing\nso itself.\n\nHowever, if the channel is already in use, the station does not continually sense it for the\npurpose of seizing it immediately upon detecting the end of the previous transmission.\n\nInstead, it waits a random period of time and then repeats the algorithm. Consequently, this\nalgorithm leads to better channel utilization but longer delays than 1-persistent COMA\n\nP-persistent CSMA\n\nIt applies to slotted channels.\n\nWhen a station becomes ready to send, it senses the channel.\n\nIf it is idle, it transmits with a probability p.\n\nWith a probability q=1-p, it defers until the next slot.\n\nIf that slot is also idle, it either transmits or defers again, with probabilities p and q.\n\nThis process is repeated until either the frame has been transmitted or another station has\nbegun transmitting.\n\nIn the latter case, the unlucky station acts as if there had been a collision (i.e., it waits a random\ntime and starts again).\n\nIf the station initially senses the channel busy, it waits until the next slot and applies the above\nalgorithm.\n\nFigure shows the computed throughput versus offered traffic for all three protocols.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 11\n"
    },
    {
      "page_number": "12",
      "content": "@\nDarshan 5 — The Link layer and Local area networks\n\nInstitute of Engineering & Technology\n\n0.01-persistent CSMA\n\nNonpersistent CSMA\n\no-=\nao)\n.\n\n0.1-persistent CSMA\n\n0.5-persistent\n\nper packet time)\nooo\noa nN @\nT\n\n0.5\n0.4\n\n°\n&\n\n0.2\n\nS (throughput\n\n°\n\n% 1 2 3 4 5 6 7 8 9\n\nG (attempts per packet time)\nFig. 9: Comparison of the channel utilization versus load for various random access protocols\n\nCSMA/CD (CSMA with Collision Detection)\ne If two stations sense the channel to be idle and begin transmitting simultaneously, they will both\ndetect the collision almost immediately.\ne Rather than finish transmitting their frames, which are irretrievably garbled anyway, they should\nabruptly stop transmitting as soon as the collision is detected.\ne Quickly terminating damaged frames saves time and bandwidth.\ne This protocol, known as CSMA/CD (CSMA with Collision Detection) is widely used on LANs in the\n\nMAC sublayer.\nContention\nb slots\n\n| A |\nrome 0} 0) (r= J [1 [tere =\n\nee,\" —_ a.\nTransmission Contention Idle\nperiod period period\n\nTime ——>\nFig. 10: CSMA/CD can be in one of three states: contention, transmission, or idle\n\ne CSMA/CD, as well as many other LAN protocols, uses the conceptual model of Figure.\n\ne Atthe point marked to, a station has finished transmitting its frame.\n\ne Any other station having a frame to send may now attempt to do so. If two or more stations\ndecide to transmit simultaneously, there will be a collision.\n\ne Collisions can be detected by looking at the power or pulse width of the received signal and\ncomparing it to the transmitted signal.\n\ne After a station detects a collision, it aborts its transmission, waits a random period of time, and\nthen tries again, assuming that no other station has started transmitting in the meantime.\n\ne Therefore, model for CSMA/CD will consist of alternating contention and transmission periods,\nwith idle periods occurring when all stations are quiet.\n\nTaking turns MAC protocols\nPolling\n\ne The polling protocol requires one of the nodes to be designated as a master node.\ne The master node polls each of the nodes in a round-robin fashion.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 12\n"
    },
    {
      "page_number": "13",
      "content": "Darshan\n\n[nistbR of Engineering & tockaotony 5 — The Link layer and Local area networks\n\nIn particular, the master node first sends a message to node 1, saying that it (node 1) can\ntransmit up to some maximum number of frames.\n\nAfter node 1 transmits some frames, the master node tells node 2 it (node 2) can transmit up to\nthe maximum number of frames.\n\nThe master node can determine when a node has finished sending its frames by observing the\nlack of a signal on the channel.\n\nThe procedure continues in this manner, with the master node polling each of the nodes in a\ncyclic manner.\n\nThe polling protocol eliminates the collisions and empty slots that plague random access\nprotocols.\n\nThis allows polling to achieve a much higher efficiency.\n\nThe first drawback is that the protocol introduces a polling delay—the amount of time required\nto notify a node that it can transmit.\n\nThe second drawback, which is potentially more serious, is that if the master node fails, the\n\nentire channel becomes inoperative.\n\n(nothing\nto send)\n\nslaves\nFig. 11: Polling Fig. 12: Token Passing\n\nToken Passing\n\nIn taking-turns protocol there is no master node.\n\nA small, special-purpose frame known as a token is exchanged among the nodes in some fixed\norder.\n\nFor example, node 1 might always send the token to node 2, node 2 might always send the\ntoken to node 3, and node N might always send the token to node 1.\n\nWhen a node receives a token, it holds onto the token only if it has some frames to transmit;\notherwise, it immediately forwards the token to the next node.\n\nIf a node does have frames to transmit when it receives the token, it sends up to a maximum\nnumber of frames and then forwards the token to the next node.\n\nToken passing is decentralized and highly efficient. But it has its problems as well. For example,\nthe failure of one node can crash the entire channel. Or if a node accidentally neglects to release\nthe token, then some recovery procedure must be invoked to get the token back in circulation.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 13\n"
    },
    {
      "page_number": "14",
      "content": "Darshan\n\nnea of Encinmestag & Teahsalog) 5 — The Link layer and Local area networks\n\nEthernet\n\nEthernet is one of the widely used local area network (LAN) technology.\n1. Switched Ethernet\n2. Fast Ethernet\n3. Gigabit Ethernet\n\nSwitched Ethernet\nSwitch\nConnector To hosts\nEtiemet b To hosts\nTo hosts\n10Base-T\nconnection\n\nTo the host computers\n\nFig. 1: A simple example of switched Ethernet\nSwitched Ethernet gives dedicated 10 Mbps bandwidth on each of its ports.\nOn each of the ports one can connect either a thick/thin segment or a computer.\nIn Switched Ethernet, the collision domain is separated.\nThe hub is replaced by a switch, which functions as a fast bridge.\nIt can recognize the destination address of the received frame and can forward the frame to the\nport to which the destination station is connected.\nThe other ports are not involved in the transmission process.\nThe switch can receive another frame from another station at the same time and can route this\nframe to its own final destination.\nIn this case, both the physical and logical topologies are star.\nThe throughput can be further increased on switched Ethernet by using full-duplex technique,\nwhich uses separate wire pairs for transmitting and receiving.\nThus a station can transmit and receive simultaneously, effectively doubling the throughput to\n20 Mbps on each port.\n\nFast Ethernet\n\nThe 802.u or the fast Ethernet, as it is commonly known, was approved by the IEEE 802\nCommittee.\n\nThe fast Ethernet uses the same frame format, same CSMA/CD protocol and same interface as\nthe 802.3, but uses a data transfer rate of 100 Mbps instead of 10 Mbps.\n\nHowever, fast Ethernet is based entirely on 10-Base-T, because of its advantages (Although\ntechnically 10-BASE-5 or 10-BASE-2 can be used with shorter segment length).\n\nIEEE has designed two categories of Fast Ethernet: 100Base-X and 100Base-T4.\n\n100Base-X uses two-wire interface between a hub and a station while 100Base-T4 uses four-\nwire interface.\n\n100-Base-x itself is divided into two: 100Base-TX and 100base-FX\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 14\n"
    },
    {
      "page_number": "15",
      "content": "Darshan\n\n[nistbR of Engineering & tockaotony 5 — The Link layer and Local area networks\n\n100Base-T4 | Twistedpair | 100m | Uses category 3 UTP\n100Base-TX Full duplex at 100 Mbps\n\n100Base-FX | Fiber optics 2000 m Full duplex at 100 Mbps; long runs\n\nUpgrade the data rate to 100 Mbps.\n\nMake it compatible with Standard Ethernet.\n\nKeep the same 48-bit address.\n\nKeep the same frame format.\n\nKeep the same minimum and maximum frame lengths.\n\nGigabyte Ethernet\n\nThe technology is based on fiber optic cable. Multi-mode fiber is able to transmit at gigabit rate\nto at least 580 meters and with single-mode runs exceeding 3 km.\n\nFiber optic cabling is costly. In order to reduce the cost of cabling, the 802.3z working group also\nproposed the use of twisted pair or cable or coaxial cable for distances up to 30 meters.\n\nAt gigabit speed, two stations 200 meters apart will not detect a collision, when both\nsimultaneously send 64-byte frames.\n\nThis inability to detect collision leads to network instability.\n\nA mechanism known as carrier extension has been proposed for frames shorter than 512 bytes.\nThe number of repeater hops is also restricted to only one in place of two for 100 Base-T.\n\nName Cable Max. segment Advantages\n1000Base-SX | Fiber optics 550m | Multimode fiber (50, 62.5 microns)\n1000Base-LX | Fiber optics 5000 m | Single (10 i) or multimode (50, 62.5 11)\n1000Base-CX | 2 Pairs of STP 25m | Shielded twisted pair\n1000Base-T 4 Pairs of UTP 100m | Standard category 5 UTP\n\nUpgrade the data rate to 1 gbps.\n\nMake it compatible with Standard or Fast Ethernet.\n\nUse the same 48-bit address.\n\nUse the same frame format.\n\nKeep the same minimum and maximum frame lengths.\nTo support auto-negotiation as defined in Fast Ethernet.\n\nVirtual LANs\n\nA VLAN is a switched network that is logically segmented by functions, project teams, or\napplications without regard to the physical location of users.\n\nFor example, several end stations might be grouped as a department, such as engineering or\naccounting.\n\nWhen the end stations are physically located close to one another, you can group them into a\nLAN segment.\n\nIf any of the end stations are in different buildings (not the same physical LAN segment), you can\nthen group them into a VLAN.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 15\n"
    },
    {
      "page_number": "16",
      "content": "Darshan\n\nInitieaea of Enginesring  Techaotogy 5 — The Link layer and Local area networks\n\nTwisted pair” Office\nto a hub\n\nFig. 14: VLAN\n\ne VLANs provide the following features:\n\nSimplification of end-station moves, adds and changes\n\ne When an end station is physically moved to a new location, its attributes can be reassigned from\na network management station through Simple Network Management Protocol (SNMP) or\nthrough the user interface menus.\n\ne When an end station is moved within the same VLAN, it retains its previously assigned attributes\nin its new location. When an end station is moved to a different VLAN, the attributes of the new\nVLAN are applied to the end station.\n\nControlled traffic activity\n\ne VLANs allow ports on the same or different switches to be grouped so that traffic is confined to\nmembers of only that group.\n\ne This feature restricts broadcast, unicast, and multicast traffic (flooding) only to ports included in\na certain VLAN.\n\ne The management domain is a group of VLANs that are managed by a single administrative\nauthority.\n\nWorkgroup and network security\n\ne You can increase security by segmenting the network into distinct broadcast domains.\n\ne To this end, VLANs can restrict the number of users in a broadcast domain.\n\ne You can also control the size and composition of the broadcast domain by controlling the size\nand composition of a VLAN.\n\nComponents\n\ne Networks that have VLANs contain one or more of the following components:\n\n> Switches that logically segment connected end stations\n\n> Routers that provide VLAN communications between workgroups\n\n> Transport protocols that carry VLAN traffic across shared LAN and ATM backbones\n> — Interoperability with previously installed LAN systems\n\nEthernet frame structure\n\nPreamble. Deta cac\n\nvi\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 16\n"
    },
    {
      "page_number": "17",
      "content": "Darshan\n\nnea of Encinmestag & Teahsalog) 5 — The Link layer and Local area networks\n\nData field (46 to 1,500 bytes): This field carries the IP datagram. The maximum transmission\nunit (MTU) of Ethernet is 1,500 bytes. This means that if the IP datagram exceeds 1,500 bytes,\nthen the host has to fragment the datagram. The minimum size of the data field is 46 bytes. This\nmeans that if the IP datagram is less than 46 bytes, the data field has to be “stuffed” to fill it out\nto 46 bytes. When stuffing is used, the data passed to the network layer contains the stuffing as\nwell as an IP datagram.\n\nDestination address (6 bytes): This field contains the MAC address of the destination adapter,\nBB-BB-BB-BB-BB-BB. When adapter B receives an Ethernet frame whose destination address is\neither BB-BB-BB-BB-BB-BB or the MAC broadcast address, it passes the contents of the frame’s\ndata field to the network layer; if it receives a frame with any other MAC address, it discards the\nframe.\n\nSources address (6 bytes): This field contains the MAC address of the adapter that transmits the\nframe onto the LAN, in this example, AA-AA-AA-AA-AA-AA.\n\nType field (2 bytes): The type field permits Ethernet to multiplex network-layer protocols. To\nunderstand this, we need to keep in mind that hosts can use other network-layer protocols\nbesides IP. In fact, a given host may support multiple network-layer protocols using different\nprotocols for different applications. For this reason, when the Ethernet frame arrives at adapter\nB, adapter B needs to know to which network-layer protocol it should pass (that is, demultiplex)\nthe contents of the data field.\n\nCyclic redundancy checks (CRC) (4 bytes): The purpose of the CRC field is to allow the receiving\nadapter, adapter B, to detect bit errors in the frame.\n\nPreamble (8 bytes): The Ethernet frame begins with an 8-byte preamble field. Each of the first 7\nbytes of the preamble has a value of 10101010; the last byte is 10101011. The first 7 bytes of\nthe preamble serve to “wake up” the receiving adapters and to synchronize their clocks to that\nof the sender’s clock. Why should the clocks be out of synchronization? Keep in mind that\nadapter A aims to transmit the frame at 10 Mbps, 100 Mbps, or 1 Gbps, depending on the type\nof Ethernet LAN. However, because nothing is absolutely perfect, adapter A will not transmit the\nframe at exactly the target rate; there will always be some drift from the target rate, a drift\nwhich is not known a priori by the other adapters on the LAN. A receiving adapter can lock onto\nadapter A’s clock simply by locking onto the bits in the first 7 bytes of the preamble. The last 2\nbits of the eighth byte of the preamble (the first two consecutive 1s) alert adapter B that the\n“important stuff” is about to come.\n\nBit and Byte Stuffing\nBit Stuffing\n\nIn a bit-oriented protocol, the data to send is a series of bits.\n\nIn order to distinguish frames, most protocols use a bit pattern of 8-bit length (01111110) as flag\nat the beginning and end of each frame.\n\nHere also cause the problem of appearance of flag in the data part to deal with this an extra bit\nadded.\n\nThis method is called bit stuffing. In bit stuffing, if a O and five successive 1 bits are encountered,\nan extra 0 is added.\n\nThe receiver node removes the extra-added zero.\n\nThis process is illustrate below,\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 17\n"
    },
    {
      "page_number": "18",
      "content": "Darshan\n\nInitieaea of Enginesring  Techaotogy 5 — The Link layer and Local area networks\n\nData to send\n(from upper\nlayer)\n\n0001111111110000101010111110010\n\nFrame to send }\nono | Header | 0001111011111000\n\n110101111100010 | Tite | vate |\n\nFrame received\nO10 | Header 900111191111100001010101111190010 | Seite\n\no1liiiie |\n\nBit unstuffed\n\nData to upper\n\nlayer\n\n9001111111110000101010111110010 |\n\nByte Stuffing\n\ne The second framing solves the problem of resynchronization by having each frame start and end\nwith special bytes.\n\ne A flag byte is used to separate the frame as both the starting and ending delimiter, as shown in\nfigure.\n\ne In this way, if the receiver ever loses synchronization, it can just search for the flag byte to find\nthe end of the current frame.\n\ne Two consecutive flag bytes indicate the end of one frame and start of the next one.\n\ne It may easily happen that the flag byte's bit pattern occurs in the data.\n\ne To solve this problem is to have the sender's data link layer insert a special escape byte (ESC)\njust before each \"accidental\" flag byte in the data.\n\ne The data link layer on the receiving end removes the escape byte before the data are given to\nthe network layer.\n\ne This technique is called byte stuffing or character stuffing.\n\nDisadvantage of using this framing method is that it is closely tied to the use of 8-bit characters.\n\ne Not all character codes use 8-bit characters.\n\ne  E.g., UNICODE uses 16-bit characters\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 18\n"
    },
    {
      "page_number": "19",
      "content": "Institute of Engineering & Technology\n\n@\nDarshan 5 — The Link layer and Local area networks\n\n|FLAG} Header Payload field Trailer |rvac|\n\n(a)\nOriginal characters After stuffing\n\n| A Fvac| B a | esc |\n\nnue] =\n\n| A [ese | |ruac| | B | A [esc | [esc | [esc lFuacl | 8 |\nA | [ese] esc] | 8 | A | [esc] [esc] [esc] | esc | 8 |\n\n{b)\n\nSelf-Learning Properties of Link Layer Switches\ne A switch has the wonderful property that its table is built automatically, dynamically, and\nautonomously, without any intervention from a network administrator or from a configuration\nprotocol. In other words, switches are self-learning.\ne = This capability is accomplished as follows:\n1. The switch table is initially empty.\n2. For each incoming frame received on an interface, the switch stores in its table\n> the MAC address in the frame’s source address field,\n> the interface from which the frame arrived\n> the current time.\nIn this manner the switch records in its table the LAN segment on which the sender\nresides. If every host in the LAN eventually sends a frame, then every host will\neventually get recorded in the table.\n3. The switch deletes an address in the table if no frames are received with that address as\nthe source address after some period of time (the aging time).\ne  Inthis manner, if a PC is replaced by another PC (with a different adapter), the MAC address of\nthe original PC will eventually be purged from the switch table.\ne —Let’s walk through the self-learning property for the uppermost switch in Figure 15.\ne Suppose at time 9:39 a frame with source address 01-12-23-34-45-56 arrives from interface 2.\ne Suppose that this address is not in the switch table. Then the switch adds a new entry to the\ntable.\ne Continuing with this same example, suppose that the aging time for this switch is 60 minutes,\nand no frames with source address 62-FE-F7-11-89-A3 arrive to the switch between 9:32 and\n10:32. Then at time 10:32, the switch removes this address from its table.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 19\n"
    },
    {
      "page_number": "20",
      "content": "Darshan\n\nInitieaea of Enginesring  Techaotogy 5 — The Link layer and Local area networks\n\nTo external ———____=-( > F\ninternet &\nS 100 Mbps\n(fiber)\n\n100 Mbps al\n\n(fiber)\n\nMixture of 10 Mbps,\n100 Mbps, 1 Gbps,\n\nCat 5 cable\n== =\n\nElectrical Engineering Computer Science Computer Engineering\nFig. 15: An institutional network connected together by four switches\n\nAddkess bnterface Time\n62-FEFT-11-89:43 ] 9:32\n7CBA82-B4-91-10 3 9:36\n\nARP (Address Resolution Protocol)\n\nAddress Resolution Protocol (ARP) is a protocol for mapping an Internet Protocol address (IP\naddress) to a physical machine address that is recognized in the local network.\n\nFor example, in IP Version 4, the most common level of IP in use today, an address is 32 bits\nlong.\n\nIn an Ethernet local area network, however, addresses for attached devices are 48 bits long.\n(The physical machine address is also known as a Media Access Control or MAC address.)\n\nA table, usually called the ARP cache, is used to maintain a correlation between each MAC\naddress and its corresponding IP address.\n\nARP provides the protocol rules for making this correlation and providing address conversion in\nboth directions.\n\nHow ARP works\n\nWhen an incoming packet destined for a host machine on a particular local area network arrives\nat a gateway, the gateway asks the ARP program to find a physical host or MAC address that\nmatches the IP address.\n\nThe ARP program looks in the ARP cache and, if it finds the address, provides it so that the\npacket can be converted to the right packet length and format and sent to the machine.\n\nIf no entry is found for the IP address, ARP broadcasts a request packet in a special format to all\nthe machines on the LAN to see if one machine knows that it has that IP address associated with\nit.\n\nA machine that recognizes the IP address as its own returns a reply so indicating.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 20\n"
    },
    {
      "page_number": "21",
      "content": "Darshan\n\nInitieaea of Enginesring  Techaotogy 5 — The Link layer and Local area networks\n\ne ARP updates the ARP cache for future reference and then sends the packet to the MAC address\nthat replied.\ne A possible ARP table in any node is as per below\n\nIP Address WAC Address Tl\n222.272.222.221 88-82-2F-54-1A0F 13:45:00\n222.272.722.223 SCOGAB907581 13:52:00\n\ne Since protocol details differ for each type of local area network, there are separate ARP\nRequests for Comments (RFC) for Ethernet, ATM, Fiber Distributed-Data Interface, HIPPI, and\nother protocols.\n\nProf. Maulik Trivedi, CE Department | 2140709 — Computer Networks (CN) 21\n"
    }
  ]
}